[
{"title": "Electronic Tax Invoicing for Non-VAT Registered Persons", "date": "PUBLIC NOTICES 27/12/2023                                ", "article": "Kenya Revenue Authority (KRA) wishes to remind the public that all persons\ncarrying on business including those who are not registered for VAT are\nrequired to electronically generate and transmit their invoices to KRA via the\nelectronic Tax Invoice Management System (eTIMS) from 1st September, 2023.\nWith effect from **1** **st** **January, 2024** , any business expenditure not\nsupported by a valid electronic tax invoice shall not be deductible for income\ntax purposes.\n\nTo facilitate business continuity and allow for sufficient time for taxpayers\nto make adjustments in their systems and business operations, KRA wishes to\nnotify **non-VAT registered taxpayers** that onboarding to the eTIMS platform\nwill be available up to **31** **st** **March, 2024**. During the onboarding\nperiod, penalties provided in law for failure to issue electronic tax invoices\nwill not be imposed on the non-VAT registered taxpayers.\n\nOnce onboarded, the taxpayers will be required to progressively capture\nmanually generated invoices and receipts issued after 1st January, 2024 up to\nthe date of onboarding, onto the KRA system.\n\nKRA is committed to continue supporting and facilitating all taxpayers to\ncomply with the requirements of the law by conducting comprehensive\nstakeholder engagements, awareness campaigns, taxpayer education and availing\nvaried solutions including simplified solutions that cater for the various\ntaxpayer segments.\n\nFor further information please call our contact centre on Tel: (0) 20 4 999\n999, 0711 099 999 or\n\nEmail: callcentre@kra.go.ke [www.kra.go.ke](http://www.kra.go.ke)\n\n**Commissioner for Domestic Taxes**\n\n**_Take advantage of the Tax Amnesty Programme Today and Enjoy 100% waiver on\naccrued interest & penalties._**\n\n* * *\n\nPUBLIC NOTICES 27/12/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2077-electronic-tax-invoicing-for-non-vat-registered-persons"},
{"title": "New Applications & Renewals For Customs Agents Licences 2024", "date": "PUBLIC NOTICES 16/10/2023                                ", "article": "\n\nKenya Revenue Authority (KRA) wishes to inform Customs Agents that their\nlicenses will expire on 31st December, 2023 with the exception of the 3-year\nAuthorised Economic Operators (AEO) licences.\n\nProvisions relating to the licensing of Customs agents are contained in\nSection 145 of the East African Community **Customs Management Act, 2004 and\nRegulations 149-152 of the East Africa Community Customs Management\nRegulations, 2010**.\n\nApplications for Renewal should be submitted through the Integrated Customs\nManagement System ( iCMS) platform, https://icms. kra.go.ke, on or before 31st\nOctober, 2023. The applications for renewal shall be accompanied by:\n\n1\\. [Duly filled form C20 ](/images/publications/c20-application-customs-\nagents-licence-year.pdf)(available on the KRA Website,\n[www.kra.go.ke)](http://www.kra.go.ke\\))\n\n2\\. Current Certificate of Registration (CR12/CR13)\n\n3\\. Valid Tax Compliance Certificate for the Company & Directors\n\n4\\. Certificate of Bond clearance 5. Copy of previous C21 (Licence)\n\n6\\. KIFWA Clearance Certificate for year of application.\n\nIn addition, we wish to invite interested New Applicants for Customs Agents\nLicenses 2024, to submit their applications by 31st October , 2023 via email\naddress cbcvetting@kra.go.ke. The applications shall be accompanied by:\n\n1\\. Tax compliance for the Company\n\n2\\. Tax compliance for the Directors\n\n3\\. Certificate of registration from Registrar of Company (CR12)\n\n4\\. Pin certificate for Company\n\n5\\. Pin certificate for Directors\n\n6\\. National ID/Passport for Directors\n\n7\\. Recent passport size photographs of directors and staff duly certified by\nNotary public or a Commissioner of Oaths\n\n8\\. Memorandum of Association, Articles of Association clearly indicating the\nClearing and Forwarding Agent firm is a registered business (where applicable)\n\n9\\. Certificate of good conduct for all directors\n\n10\\. Valid Tenancy agreement/Lease or Title deed if you own the premises\n\n11\\. Letter from bankers showing the Company maintains an account with them\n\n12\\. Letter from bankers showing the Directors maintain an account with them\n\n13\\. Audited accounts for the last 3 years (where applicable)\n\n14\\. Proof of affiliation/membership with KIFWA- certificate for the year of\napplication, payment receipt or letter.\n\n15\\. Duly filled [Bio Data form](/images/publications/STAKEHOLDER-BIO-DATA-\nFORM.pdf) available in KRA website [www.kra.go.ke. ](http://www.kra.go.ke.)\n\n16\\. Duly filled form C20 available on the KRA website, [www.kra.go.ke\n](http://www.kra.go.ke)\n\n17\\. A copy of the current year (2021) license\n\n18\\. Payment of 50USD application fee is mandatory before the interview.\n\n19\\. The Applicant must have an established office, the physical location of\nwhich shall be indicated in the license application form for Customs\nverification purposes\n\nFor further clarification and facilitation, please call the Licensing office\non Tel: 0770 319998 & 0709 016616/7 or Email:\n[agentslicensing@kra.go.ke](mailto:agentslicensing@kra.go.ke)\n\n**Commissioner, Customs & Border Control**\n\n* * *\n\nPUBLIC NOTICES 16/10/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2064-new-applications-renewals-for-customs-agents-licences-2024"},
{"title": "Fringe Benefit Tax, Deemed Interest Rate and  Low Interest Benefit", "date": "PUBLIC NOTICES 31/10/2023                                ", "article": "\n\n**FRINGE BENEFIT TAX**\n\nFor the purposes of Section 12B of the Income Tax Act, the **Market Interest\nRate is 13%.** This rate shall be applicable for the three months of\n**October, November and December 2023.**\n\n**DEEMED INTEREST RATE**\n\nFor purposes of section 16(2)(ja) of the Income Tax Act , the **prescribed\nrate of interest is 13%.** This rate is applicable for the months of\n**October, November and December 2023.**\n\nWithholding tax rate of 15% on the deemed interest shall be deducted and paid\nto the Commissioner by the **20th day** of the month following the month of\ncomputation.\n\n**LOW INTEREST BENEFIT** ****\n\nFor purposes of section 5(2A), the **prescribed rate of interest is 10%.**\nThis rate is applicable for the months of **July, August, September, October,\nNovember and December 2023.** ****\n\n**Commissioner for Domestic Taxes**\n\n****\n\n* * *\n\nPUBLIC NOTICES 31/10/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2066-fringe-benefit-tax,-deemed-interest-rate-and-low-interest-benefit-2"},
{"title": "Clearance at Passenger Terminals", "date": "PUBLIC NOTICES 02/11/2023                                ", "article": "\n\nThe Kenya Revenue Authority (KRA) is mandated to collect revenue on behalf of\nthe Government of Kenya in line with the Customs laws and other national and\ninternational laws regulating passenger movements. KRA implements various\ninitiatives to promote tax compliance, seal revenue loopholes and enhance\nrevenue mobilization.\n\nKRA is committed to continuous improvement and is in the process of upgrading\nthe use of technology to enhance non-intrusive inspection of baggage at all\npoints of entry. Part of this process is to ensure that prohibited and\nrestricted goods are screened out for security purposes.\n\nFor passenger clearance at terminals, KRA informs the public as follows:\n\n**Clearance of Personal items/effects** : All used personal items/effects are\nexempt from customs duties.\n\n**Clearance of new items** : As per the law affecting all **East African\nCountries** , goods of up to the value of **USD 500** for each traveler are\nexempted from import tax, in so far as the baggage is accompanied and declared\nto the Customs Officer. However, KRA is in the process of reviewing this\nregulation to a higher limit and this shall be communicated to the public in\ndue course.\n\n**Baggage handling** : Scanning of traveler’s baggage is done to ensure\ncorrect declarations for purposes of taxation and to screen out prohibited and\nrestricted goods for the safety of all Kenyans. Items flagged out after the\nfirst line x-ray/non-intrusive scanning process will undergo a physical\ninspection by the Customs Officer.\n\n**Determination of Duties** : Where imported goods are subject to customs\nduty, a passenger is required to self-declare the actual price of the item(s).\nThe duty to be paid (if any) shall be based on the actual purchase price as\ndeclared by the passenger/traveler. All passengers are thus required to\ndeclare the specified items in the **Passenger Declaration Form (F88)** ,\nprior to arrival in Kenya, and present it to a Customs Official at the point\nof entry. However, a passenger has a right to query the assessed customs duty\nand may seek an explanation from the Customs Officer.\n\n**Payment of Duties** : Customs duty is paid at appointed banks located within\nthe terminals, or through mobile banking platform after the Customs Officer\ngenerates electronic payment slip.\n\nSee more information on the KRA website link: kra.go.ke, email:\ncallcentre@kra.go.ke, the Contact Centre on 020 4999 999 or 0711 099 999, or\nvisit any KRA office near you.\n\n**Commissioner of Customs & Border Control **\n\n* * *\n\nPUBLIC NOTICES 02/11/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2067-clearance-at-passenger-terminals"},
{"title": "Tax Payment through PayBill Number 222222", "date": "PUBLIC NOTICES 17/11/2023                                ", "article": "\n\nKenya Revenue Authority (KRA) notifies taxpayers that all tax payments via\nmobile money shall only be made through the Government PayBill number 222222\nwith immediate effect in line with the Kenya Gazette No. 16008 of 2022 and the\nPresidential Directive designating the use of Paybill Number 222222 as the\nGovernment’s single payment platform.\n\nTaxpayers are further advised to use the Payment Registration Number (PRN) or\nthe Ref. Number on the Payment Slips generated from KRA Business Systems:\niTax, iCMS, EGMS, and KESRA iStudent as the account number when making tax\npayment via mobile money. KRA guides taxpayers to proceed with tax payment\nthrough mobile money as follows:\n\n  1. Enter PayBill number 222222\n  2. Enter the PRN (payment registration number) as the account number\n  3. Key in the amount as indicated on the PRN\n  4. Enter your PIN and click send\n\nOR\n\n  1. Dial *222#\n  2. Select Pay KRA bill option\n  3. Enter the E-slip (PRN) number\n  4. Select payment mode as M-Pesa\n  5. Enter M-Pesa PIN and complete the rest of the process.\n\nFor further information please call our Contact Centre on: Telephone No:\n020-4-999-999 or 0711-099-999, or Email:\n[callcentre@kra.go.ke](mailto:callcentre@kra.go.ke)\n\nCommissioner for Corporate Support Services.\n\n* * *\n\nPUBLIC NOTICES 17/11/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2070-tax-payment-through-paybill-number-222222"},
{"title": "On Boarding of Non-VAT Taxpayers on eTIMS", "date": "PUBLIC NOTICES 17/11/2023                                ", "article": "\n\nKenya Revenue Authority (KRA) wishes to notify the public that pursuant to the\nprovisions of the Finance Act 2023, effective 1st September, 2023, All persons\ncarrying on business, including those not registered for VAT, are required to\nelectronically generate and transmit their invoices to KRA via the electronic\nTax Invoice Management System (eTIMS).\n\nPlease note that any business expenditure not supported by an eTIMS generated\ntax invoice shall not be deductible for tax purposes with effect from **1st\nJanuary, 2024**.\n\nKRA will continue to support and facilitate all taxpayers to comply with the\nrequirements of the Law.\n\nFor further information please call our contact centre on Tel: (0) 20 4 999\n999, 0711 099 999 or Email: callcentre@kra.go.ke\n[www.kra.go.ke,](http://www.kra.go.ke,)\n\n**Commissioner for Domestic Taxes**\n\n* * *\n\nPUBLIC NOTICES 17/11/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2071-on-boarding-of-non-vat-taxpayers-on-etims"},
{"title": "Regulations Under The Income Tax Act (Cap 470) And The Tax Procedures Act (Cap 469B)  ", "date": "PUBLIC NOTICES 23/11/2023                                ", "article": "\n\nIn compliance with the Statutory Instruments Act 2013, the Commissioner\nGeneral on behalf of the Cabinet Secretary for the National Treasury and\nEconomic Planning, has reviewed the regulations/rules under the above\nlegislations and developed the following draft regulations:\n\n  * [The Income Tax (Turnover Tax) Regulations, 2023](/images/publications/Draft-Income-Tax-Turnover-Tax--Regulations--2023_compressed.pdf); and\n  * [The Tax Procedures (Electronic Tax Invoice) Regulations, 2023.](/images/publications/Draft-Tax-Procedures-Electronic-Tax-Invoice-Regulations-2023_compressed.pdf)\n\nIn compliance with the same Act, and on behalf of the Cabinet Secretary for\nthe National Treasury and Economic Planning, the Commissioner General invites\ninterested members of the public and stakeholders to submit their inputs and\ncomments for consideration in finalizing of the above regulations. These draft\nregulations have been posted on the KRA website,\n[_www.kra.go.ke_](/publications) _._ You may download the same for your\nreference.\n\nPlease channel your submissions to the Commissioner General, Kenya Revenue\nAuthority, P.O Box 48240-00100, Nairobi or by email to\n[stakeholder.engagement@kra.go.ke](mailto:stakeholder.engagement@kra.go.ke) to\nbe received on or before 8th December, 2023.\n\n**_COMMISSIONER GENERAL_**\n\n* * *\n\nPUBLIC NOTICES 23/11/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2073-regulations-under-the-income-tax-act-cap-470-and-the-tax-procedures-act-cap-469b"},
{"title": "Simplification of the VAT Return Filing Process", "date": "PUBLIC NOTICES 28/11/2023                                ", "article": "\n\nKenya Revenue Authority (KRA) wishes to notify the public and all VAT\nregistered taxpayers that in an effort to leverage on technology and improve\ntaxpayer experience, the VAT return will be pre-filled with tax information\navailable to KRA with effect from the January 2024 tax period, to simplify the\nVAT return filing process for taxpayers.\n\nIn this regard, we remind all taxpayers of their obligation to issue\nelectronic tax invoices and transmit the invoice details to KRA as prescribed\nin law. Please note that any input VAT claim that is not validated through\nTIMS/eTIMS or against existing customs import declarations for import VAT\nclaims will not be allowed. A list of approved eTIMS third party system-to-\nsystem integrators is available on the KRA website to facilitate compliance\nwith electronic tax invoicing requirements.\n\nFurther, we advise taxpayers that the pre-filled VAT return shall be a self-\nassessment return as prescribed in Section 28(4) of the Tax Procedures Act,\nCAP 469B and a taxpayer shall not be relieved of the obligation to confirm the\naccuracy of the declaration before submission of the return.\n\nKRA will conduct sensitization for taxpayers on the simplified VAT Return\nfiling process and will continue to support and facilitate all taxpayers to\ncomply with the electronic tax invoicing requirements. We take this\nopportunity to thank all compliant taxpayers.\n\nFor further information please call our Contact Centre on Tel: (0) 20 4 999\n999, 0711 099 999 or Email: callcentre@kra.go.ke\n[www.kra.go.ke](http://www.kra.go.ke)\n\n**Commissioner for Domestic Taxes**\n\n* * *\n\nPUBLIC NOTICES 28/11/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2074-simplification-of-the-vat-return-filing-process"},
{"title": "Tax (Donations & Charitable Organisations Exemption) Rules, 2023", "date": "PUBLIC NOTICES 14/12/2023                                ", "article": "\n\nIn compliance with the Statutory Instruments Act, 2013 the Commissioner\nGeneral on behalf of the Cabinet Secretary, National Treasury and Economic\nPlanning, has developed the Draft Income Tax (Donations and Charitable\nOrganisations Exemption) Rules, 2023. The Rules provide guidelines and\nadministrative procedures to be applied in granting exemptions to charitable\norganisations and further gives guidance on donations to such institutions.\n\nIn compliance with the same Act, and on behalf of the Cabinet Secretary, the\nNational Treasury and Economic Planning, the Commissioner General invites\ninterested members of the public, professionals and stakeholders to submit\ntheir inputs and comments for consideration in finalising the Rules. The draft\nrules have been posted on the KRA website. [You may download the draft Rules\nfor your reference](/images/publications/Final-Draft-Income-Tax-Donations-and-\nCharitable-Organizations-Exemption-Rules-2023.pdf).\n\nPlease channel your submissions to the Commissioner General, Kenya Revenue\nAuthority, P.O Box 48240-00100, Nairobi or by email to\nstakeholder.engagement@kra.go.ke to be received on or before 29th December,\n2023.\n\n**Commissioner General**\n\n**_Take advantage of the Tax Amnesty Programme Today and Enjoy 100% waiver on\naccrued interest & penalties._**\n\n* * *\n\nPUBLIC NOTICES 14/12/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2075-tax-donations-charitable-organisations-exemption-rules,-2023"},
{"title": "Verification Rates - Q2 2023/2024", "date": "PUBLIC NOTICES 22/12/2023                                ", "article": "\n\nKenya Revenue Authority (KRA) is implementing initiatives aimed at improving\nboth documentary and border compliance. One of the initiative is reduction of\nverification rate to 20%.\n\nKRA wishes to notify the import and export trade stakeholders that the\nverification rates for ICDN and CFS for the period 1st October to 21st\nDecember, 2023 are as follows:\n\n|\n\n**Quarter Two**\n\n|\n\n**Port**\n\n|\n\n**CFS**\n\n|\n\n**ICDN**  \n  \n---|---|---|---|---  \n  \n1.\n\n|\n\nOctober\n\n|\n\n2.46%\n\n|\n\n9%\n\n|\n\n11%  \n  \n2.\n\n|\n\nNovember\n\n|\n\n1.70%\n\n|\n\n5%\n\n|\n\n11%  \n  \n3.\n\n|\n\nDecember\n\n|\n\n1.64%\n\n|\n\n8%\n\n|\n\n9%  \n  \n|\n\n**Average**\n\n|\n\n**1.93%**\n\n|\n\n**7.33%**\n\n|\n\n**10.33%**  \n  \n|\n\n**Cumulative Average**\n\n|\n\n**6.53%**  \n  \nWe applaud all stakeholders who continue to uphold their compliance levels and\nthis reduces the verification rates.\n\n* * *\n\nPUBLIC NOTICES 22/12/2023\n\n* * *\n\n", "url": "https://www.kra.go.ke/news-center/public-notices/2076-verification-rates-q2-2023-2024"}
]